tests/parametric_sweep_test/solution_foam_dict/base_case_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

L               0.1;

A               0.01;

B               0.02;

hx              20;

hy              10;

hz              10;

convertToMeters 1;

vertices        ( ( 0 0 0 ) ( $L 0 0 ) ( $L $A 0 ) ( 0 $A 0 ) ( 0 0 $B ) ( $L 0 $B ) ( $L $A $B ) ( 0 $A $B ) );

blocks          ( hex ( 0 1 2 3 4 5 6 7 ) ( $hx $hy $hz ) simpleGrading ( 1 1 1 ) );

edges           ( );

boundary        ( inlet { type patch ; faces ( ( 0 4 7 3 ) ) ; } outlet { type patch ; faces ( ( 2 6 5 1 ) ) ; } lowerWall { type wall ; faces ( ( 1 5 4 0 ) ) ; } upperWall { type wall ; faces ( ( 3 7 6 2 ) ) ; } frontAndBack { type wall ; faces ( ( 0 3 2 1 ) ( 4 5 6 7 ) ) ; } );

mergePatchPairs ( );


// ************************************************************************* //
